Revit 2024 API
TemperatureRatingType.RemoveInsulationType Method
 Remove an existing insulation type from this temperature rating type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void RemoveInsulationType(
	InsulationType insulationType
)
Visual Basic
Public Sub RemoveInsulationType ( _
	insulationType As InsulationType _
)
Visual C++
public:
void RemoveInsulationType(
	InsulationType^ insulationType
)
Parameters
insulationType
Type: Autodesk.Revit.DB.Electrical.InsulationType
Insulation type to be removed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The last one insulation type of project and any one which is in use by a wire type can't be removed.
See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace